tutorials/crysImpurityPBEFoam/analyticGrowth/0/Ci
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      Ci;
}

dimensions      [1 -3 0 0 0 0 0];
internalField   uniform 2;

boundaryField
{
    walls
    {
        type zeroGradient;
    }
}

