tutorials/crysImpurityPBEFoam/analyticGrowth/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM                                        |
|  \\    /   O peration     |                                                 |
|   \\  /    A nd           |                                                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

libs                ("libcrystalPopuBal.so");

application         crysImpurityPBEFoam;
startFrom           startTime;
startTime           0;
stopAt              endTime;
endTime             5;
deltaT              0.1;

writeControl        timeStep;
writeInterval       50;
purgeWrite          0;
writeFormat         ascii;
writePrecision      12;
writeCompression    off;
timeFormat          general;
timePrecision       8;
runTimeModifiable   false;
adjustTimeStep      off;

// ************************************************************************* //

